Repository: JimGiouvanakis/SmartFarmIHU_2
Catalog: SmartFarmIHU/Resources/Localizable/*.lproj/Localizable.strings
Languages: el

# homeView_title
source: Implementation and utilization of techniques and solutions derived from Smart Agriculture
el: Εφαρμογή και αξιοποίηση τεχνικών και λύσεων που προέρχονται από την Έξυπνη Γεωργία

# homeView_button_title
source: Plant Disease Detection
el: Ανίχνευση Ασθένειας Φυτών

# homeView_subtitle
source: This project focuses on developing innovative deep learning applications and models for estimating plant growth through image data. We are creating a web application that allows farmers to upload photos of their plants or crops and receive in response, through the trained model, the corresponding layout that will help them make decisions about their growth.
el: Αυτό το έργο επικεντρώνεται στην ανάπτυξη καινοτόμων εφαρμογών βαθιάς μάθησης και μοντέλων για την εκτίμηση της ανάπτυξης των φυτών μέσω δεδομένων εικόνας. Δημιουργούμε μια διαδικτυακή εφαρμογή που επιτρέπει στους αγρότες να ανεβάζουν φωτογραφίες των φυτών ή των καλλιεργειών τους και να λαμβάνουν ως απάντηση, μέσω του εκπαιδευμένου μοντέλου, την αντίστοιχη διάταξη που θα τους βοηθήσει να λάβουν αποφάσεις για την ανάπτυξη τους.

# infoView_smartArgi_title
source: Smart Farm
el: Εξυπνη Γεωργία

# infoView_smartArgi_subtitle
source: Smart Agriculture, or Intelligent Farming, is a modern approach to traditional agriculture. It combines cutting-edge technologies, sensors and data analysis to optimize agricultural activities.
el: Η Έξυπνη Γεωργία, ή αλλιώς Ευφυής Γεωργία, αποτελεί μια σύγχρονη προσέγγιση της κλασικής γεωργίας. Συνδυάζει τεχνολογίες αιχμής, αισθητήρες και ανάλυση δεδομένων για τη βελτιστοποίηση των αγροτικών δραστηριοτήτων

# infoView_winnings_title
source: What do we gain?
el: Τι κερδίζουμε?

# infoView_winnings_list1
source: • Crop risk is reduced
el: • Μειώνεται το ρίσκο των καλλιεργειών

# infoView_winnings_list2
source: • Product quality and performance increase
el: • Αυξάνεται η ποιότητα και η απόδοση των προϊόντων

# infoView_winnings_list3
source: • Real-time progress or problem updates
el: • Ενημέρωση πορείας ή προβλήματος σε πραγματικό χρόνο

# infoView_diseases_title
source: Diseases
el: Ασθένειες

# infoView_diseases_list1
source: • They cause a significant reduction in physical and economic productivity
el: • Προκαλούν σημαντική μείωση στη φυσική και οικονομική παραγωγικότητα

# infoView_diseases_list2
source: • They can lead to crop loss if not identified and treated promptly.
el: • Μπορούν να οδηγήσουν σε απώλεια καλλιεργειών, αν δεν εντοπιστούν και αντιμετωπιστούν έγκαιρα

# inforView_package_title
source: Work Packages
el: Πακέτα Εργασίας

# inforView_package_subtitle
source: The project includes the design of the architecture, the development of deep learning algorithms and their integration into a web application with automation functions. Data quality and security are ensured, while the system is piloted. Support is provided with the procurement of equipment and dissemination of the results.
el: Το έργο περιλαμβάνει τη σχεδίαση αρχιτεκτονικής, την ανάπτυξη αλγορίθμων βαθιάς μάθησης και την ενσωμάτωσή τους σε διαδικτυακή εφαρμογή με λειτουργίες αυτοματισμού. Διασφαλίζεται η ποιότητα και ασφάλεια δεδομένων, ενώ το σύστημα αξιολογείται πιλοτικά. Παρέχεται υποστήριξη με προμήθεια εξοπλισμού και διάχυση των αποτελεσμάτων.

# inforView_global_title
source: International Conferences
el: Διεθνή Συνέδρια

# inforView_local_title
source: National Conferences
el: Εθνικά Συνέδρια

# inforView_local_list1
source: • Recording crop heights and crop characterization
el: • Καταγραφή υψών καλλιεργειών και χαρακτηρισμός καλλιέργειας

# inforView_local_list2
source: • Plant disease detection using deep machine learning techniques, 34th Panhellenic Statistics Conference
el: • Εντοπισμός φυτικών ασθενειών με τεχνικές βαθιάς μηχανικής μάθησης, 34ο Πανελλήνιο Συνέδριο Στατιστικής

# inforView_magazine_title
source: International Magazines
el: Διεθνή Περιοδικά
