//
//  AppTextConstants.swift
//  SmartFarmIHU
//
//  Created by Dimitris Giouvanakis on 11/12/24.
//

import Foundation

class AppTextConstants {
    
    static let LobbyHeader = "Εφαρμογή και αξιοποίηση τεχνικών και λύσεων που προέρχονται από την Έξυπνη Γεωργία" 
    
    static let LobbyButton = "Ανίχνευση Ασθένειας Φυτών on-line"
    
    static let LobbyButtonSubTittle = "(61 διαφορετικές κατηγορίες)"
    
    static let TextViewText1 = "Συγκεκριμένα σε αυτό το έργο αναπτύσσουμε καινοτόμες εφαρμογές βαθιάς μάθησης και μοντέλα για την εκτίμηση της ανάπτυξης των φυτών χρησιμοποιώντας δεδομένα εικόνας."
    
    static let TextViewText2 = "Τα δεδομένα λαμβάνονται με διάφορους τρόπους: Εικόνες α) από έξυπνες κινητές συσκευές (smart phones, tablet, camera) β) λήψεις εικόνων από drones γ) λήψεις σημείων των καλλιεργειών με συσκευή lidar από drone."
    
    static let TextViewText3 = "Τα δεδομένα λαμβάνονται με διάφορους τρόπους: Εικόνες α) από έξυπνες κινητές συσκευές (smart phones, tablet, camera) β) λήψεις εικόνων από drones γ) λήψεις σημείων των καλλιεργειών με συσκευή lidar από drone."
    
    static let TextViewListHeader = "Με τη χρήση drone"
    
    static let TextViewListItem1 = "α) θα γίνεται σάρωση της καλλιέργειες με lidar ή φωτογραμμετρία"
    
    static let TextViewListItem2 = "β) θα εντοπίζονται τα σημεία (x,y) με ανωμαλίες στην εξέλιξη της καλλιέργειας,"
    
    static let TextViewListItem3 = "γ) θα λαμβάνονται φωτογραφίες υψηλής ανάλυσης,"
    
    static let TextViewListItem4 = "δ) θα αποστέλλονται στο μοντέλο διάγνωσης και"
    
    static let TextViewListItem5 = "ε) θα ενημερώνεται ο γεωπόνος ή ο αγρότης με οδηγίες για την αντιμετώπισης της ανωμαλίας αυτής."
    
    static let TextViewFooterText1 = "Για την προτεινόμενη εφαρμογή απαιτείται ο κατάλληλος σχεδιασμός και ανάπτυξη αλγορίθμων καθώς και η δημιουργία σχετικού λογισμικού για την αυτόματη αξιολόγηση της αγροτικής καλλιέργειας από την ψηφιακή εικόνα."
    
    static let TextViewFooterText2 = "Διατίθεται μια πλατφόρμα ασύγχρονης εκπαίδευσης για την εξ αποστάσεως εκπαίδευση των αγροτών σε νέες τεχνολογίες για βιώσιμη γεωργία, ορθολογική χρήση φυτοφαρμάκων – λιπασμάτων και συντήρηση μηχανημάτων, ψεκαστήρες κ.λπ."
}
