//
//  AppTextConstants.swift
//  SmartFarmIHU
//
//  Created by Dimitris Giouvanakis on 11/12/24.
//

import Foundation

class AppTextConstants {
    
    // MARK: - LobbyView Texts
    
    static var LobbyHeader: String  { AppViewModel.shared.appLanguage == .greek
        ? "Εφαρμογή και αξιοποίηση τεχνικών και λύσεων που προέρχονται από την Έξυπνη Γεωργία"
        : "Test in english" }
    
    static let LobbyButton = "Ανίχνευση Ασθένειας Φυτών on-line"
    
    static let LobbyButtonSubTittle = "(61 διαφορετικές κατηγορίες)"
    
    // MARK: - TextView Texts
    
    static let TextViewText1 = "Συγκεκριμένα σε αυτό το έργο αναπτύσσουμε καινοτόμες εφαρμογές βαθιάς μάθησης και μοντέλα για την εκτίμηση της ανάπτυξης των φυτών χρησιμοποιώντας δεδομένα εικόνας."
    
    static let TextViewText2 = "Τα δεδομένα λαμβάνονται με διάφορους τρόπους: Εικόνες α) από έξυπνες κινητές συσκευές (smart phones, tablet, camera) β) λήψεις εικόνων από drones γ) λήψεις σημείων των καλλιεργειών με συσκευή lidar από drone."
    
    static let TextViewText3 = "Τα δεδομένα λαμβάνονται με διάφορους τρόπους: Εικόνες α) από έξυπνες κινητές συσκευές (smart phones, tablet, camera) β) λήψεις εικόνων από drones γ) λήψεις σημείων των καλλιεργειών με συσκευή lidar από drone."
    
    static let TextViewListHeader = "Με τη χρήση drone"
    
    static let TextViewListItem1 = "α) θα γίνεται σάρωση της καλλιέργειες με lidar ή φωτογραμμετρία"
    
    static let TextViewListItem2 = "β) θα εντοπίζονται τα σημεία (x,y) με ανωμαλίες στην εξέλιξη της καλλιέργειας,"
    
    static let TextViewListItem3 = "γ) θα λαμβάνονται φωτογραφίες υψηλής ανάλυσης,"
    
    static let TextViewListItem4 = "δ) θα αποστέλλονται στο μοντέλο διάγνωσης και"
    
    static let TextViewListItem5 = "ε) θα ενημερώνεται ο γεωπόνος ή ο αγρότης με οδηγίες για την αντιμετώπισης της ανωμαλίας αυτής."
    
    static let TextViewFooterText1 = "Για την προτεινόμενη εφαρμογή απαιτείται ο κατάλληλος σχεδιασμός και ανάπτυξη αλγορίθμων καθώς και η δημιουργία σχετικού λογισμικού για την αυτόματη αξιολόγηση της αγροτικής καλλιέργειας από την ψηφιακή εικόνα."
    
    static let TextViewFooterText2 = "Διατίθεται μια πλατφόρμα ασύγχρονης εκπαίδευσης για την εξ αποστάσεως εκπαίδευση των αγροτών σε νέες τεχνολογίες για βιώσιμη γεωργία, ορθολογική χρήση φυτοφαρμάκων – λιπασμάτων και συντήρηση μηχανημάτων, ψεκαστήρες κ.λπ."
    
    // MARK: - LobbyFooterView Texts
    
    static let FooterViewText = "Designed by alkisser. All Rights Reserved © 2022."
    
    // MARK: - DropDown Menu Texts
    
    static let home = "Αρχική"
    
    static let purpose = "Σκοπός του Έργου"
    
    static let team = "Ομάδα Έργου"
    
    static let package = "Πακέτα Εργασίας"
    
    static let result = "Αποτελέσματα"
    
    static let contract = "Επικοινωνία"
    
    static let english = "English"
    
    
    // MARK: - PurposeView Texts
    
    static let header = "Σκοπός του Έργου"
    
    static let headerTitle = "Εφαρμογή και αξιοποίηση τεχνικών και λύσεων που προέρχονται από την Έξυπνη Γεωργία."
    
    static let headerSubTittle = "- Σκοπός -"
    
    static let buttonDiseases = "61 Ασθένειες Φυτών"
    
    static let buttonSmartFarming = "Έξυπνη Γεωργία (ή Ευφυής γεωργία)"
    
    static let buttonΤechniques = "Εφαρμογή και αξιοποίηση τεχνικών και λύσεων που προέρχονται από την Έξυπνη Γεωργία."
    
    static let buttonChart = "Διάγραμμα ροής του έργου"
    
    static let buttonGrowth = "Αποτύπωση της ανάπτυξης μιας καλλιέργειας"
    
    static let buttonFind = "Εύρεση προβληματικών περιοχών"
    
    static let buttonMethodology = "Μεθοδολογία Μοντέλου Μηχανικής Μάθησης"
    
    static let buttonDeveloping = "Ανάπτυξη μοντέλων βαθιάς μηχανικής μάθησης"
    
    
    // MARK: - DiseasesView Texts
    
    static let Text1 = "Οι 61 διαφορετικές κατηγορίες φυτικών ασθενειών που μπορεί να αναγνωρίσουν"
    
    static let Text2 = "τα 7 εκπαιδευμένα μοντέλα Βαθιάς Μηχανικής Μάθησης."
    
    static let machineLearningModels = [
        "EfficientNetB0",
        "EfficientNetB1",
        "EfficientNetB7",
        "ResNet50",
        "VGG15",
        "MobileNet",
        "Custom SerresCNN",
    ]
    
    static let Text3 = "dataset με  61 κατηγορίες (38 VillagePlant Dataset +23 SerresPlant Dataset)"
    
    static let plantDiseases = [
        "Αμπέλι Ερινώση",
        "Αμπέλι Ιαπωνικό σκαθάρι",
        "Αμπέλι Περονόσπορος",
        "Αμπέλι Φύλλα Υγιές",
        "Αμυγδαλιά εξοάσκος",
        "Αμυγδαλιά μονίλια",
        "Αμυγδαλιά υγιές",
        "Αμυγδαλιά φουζικόκο",
        "Αχλαδιά σκωρίασιAxladia Skoriash",
        "Βακκίνιο υγιές",
        "Βαμβάκη Αφίδες",
        "Βαμβάκη πράσινο σκουλίκι",
        "Βαμβάκη Τερτάνυξος",
        "Βαμβάκη Υγιές",
        "Βατόμουρο υγιές",
        "Βερυκοκιά σκαθάρη",
        "Γαρυφαλλιά Θύπας",
        "Ελιά Κυκλώνιο",
        "Ηλία άκαρη",
        "Ηλία υγιές",
        "Ιός μπούκλας κίτρινων φύλλων ντομάτας",
        "Καλαμπόκη Ανθράκας",
        "Καλαμπόκη Σεζαμία",
        "Καλαμπόκη υγιές",
        "Καλαμπόκι (αραβόσιτος) Βόρειος Φύλλος",
        "Καλαμπόκι (καλαμπόκι) Κηλίδα φύλλου Cercospora Γκρι κηλίδα φύλλου",
        "Καλαμπόκι (καλαμπόκι) Κοινή σκουριά",
        "Καλαμπόκι (καλαμπόκι) υγιές",
        "Καρύδια Ανθρακός",
        "Καψάλισμα φύλλων φράουλας",
        "Κεράσι (συμπεριλαμβανομένου του ξινιού) υγιές",
        "Κεράσι (συμπεριλαμβανομένου του ξινού) Ερυσίδι",
        "Κηλίδα σε φύλλα ντομάτας Septoria",
        "Κηλίδα φύλλων σταφυλιού (Isariopsis Leaf Spot)",
        "Κολοκυθάκι ωίδιο",
        "Μαύρη σήψη σταφυλιού",
        "Μήλο Cedar σκουριά μήλων",
        "Μήλο Septoriosh",
        "Μήλο Μαύρη σήψη",
        "Μήλο μήλο ψώρα",
        "Μήλο υγιές",
        "Μούχλα φύλλων όψιμης ντομάτας",
        "Μχλια Μχλολονθη",
        "Ντομάτα Ακάρεα αράχνης με δύο κηλίδες",
        "Ντομάτα Βακτηριδιακό σημείο",
        "Ντομάτα Ιός μωσαϊκού ντομάτας",
        "Ντομάτα Πρώιμη μάστιγα",
        "Ντομάτα υγιής",
        "Πατάτα όψιμο μόσχο",
        "Πατάτα Πρώιμη μάστιγα",
        "Πατάτα υγιής",
        "Πιπέρι υγιές",
        "Πιπεριά καμπάνα Βακτηριδιακό σημείο",
        "Πορτοκαλί Haunglongbing (πρασίνισμα εσπεριδοειδών)",
        "Ροδάκινο Βακτηριδιακό σημείο",
        "Ροδάκινο υγιές",
        "Σημείο στόχου ντομάτας",
        "Σόγια υγιής",
        "Σταφύλι esca (Μαύρη Ιλαρά)",
        "Σταφύλι υγιές",
        "Φράουλα υγιής"
    ]
    
    
    static let bulletPoint = "\u{2022}"
    
    // MARK: - SmartFarmingView Texts
    
    static let smartFarmingList = [
        "Η Έξυπνη Γεωργία (ή Ευφυής γεωργία ) αποτελεί εξέλιξη της κλασικής γεωργίας που συνδυάζει σύγχρονες τεχνολογίες, αισθητήρες και δεδομένα για να βελτιστοποιήσει υπάρχουσες αγροτικές δραστηριότητες, μειώνοντας το ρίσκο και παράλληλα αυξάνοντας την ποιότητα και την απόδοση των αγροτικών προϊόντων.",
        "Επιπλέον δίνει νέες και καινοτόμες δυνατότητες στους αγρότες όπως η παρακολούθηση δεδομένων σχετικά με τον αγρό τους σε πραγματικό χρόνο με την χρήση της επιστήμης για την άμεση και αποτελεσματική λήψη αποφάσεων."
    ]
    
    static let smartFarmText1 = "Ευφυής γεωργία σημαίνει ορθές γεωργικές πρακτικές, που συμβάλλουν στην εξοικονόμηση διαθέσιμων φυσικών πόρων και στη βέλτιστη χρήση των εισροών στη γεωργία."
    
    static let smartFarmText2 = "Οι εχθροί και ασθένειες των φυτών θεωρούνται από τους κύριους παράγοντες που επηρεάζουν την παραγωγή τροφίμων και ευθύνονται για τη σημαντική μείωση της φυσικής ή οικονομικής παραγωγικότητας των καλλιεργειών."
    
    static let smartFarmText3 = "Κύρια πρόκληση της γεωργίας είναι ο σωστός εντοπισμός των συμπτωμάτων των εχθρών και ασθενειών που επηρεάζουν τις καλλιέργειες και η ακριβής και έγκαιρη διάγνωση τους ώστε να ακολουθηθούν οι κατάλληλες πρακτικές αντιμετώπισης."
    
    // MARK: - TechniquesView Texts
    
    static let techiquesList = [
        "Συγκεκριμένα σε αυτό το έργο αναπτύσσουμε καινοτόμες εφαρμογές βαθιάς μάθησης και μοντέλα για την εκτίμηση της ανάπτυξης των φυτών χρησιμοποιώντας δεδομένα εικόνας.",
        "Τα δεδομένα λαμβάνονται με διάφορους τρόπους: Εικόνες α) από έξυπνες κινητές συσκευές (smart phones, tablet, camera) β) λήψεις εικόνων από drones γ) λήψεις σημείων των καλλιεργειών με συσκευή lidar από drone",
        "Αναπτύσσεται μια διαδικτυακή εφαρμογή όπου ο αγρότης μπορεί να ανεβάσει φωτογραφία ενός φυτού ή της καλλιέργειας και θα λάβει ως απάντηση από το εκπαιδευμένο μοντέλο βαθιάς μάθησης την αντίστοιχη διάταξη για τη λήψη αποφάσεων.",
        "Με τη χρήση drone α) θα γίνεται σάρωση της καλλιέργειες με lidar ή φωτογραμμετρία β) θα εντοπίζονται τα σημεία (x,y) με ανωμαλίες στην εξέλιξη της καλλιέργειας, γ) θα λαμβάνονται φωτογραφίες υψηλής ανάλυσης, δ) θα αποστέλλονται στο μοντέλο διάγνωσης και ε) θα ενημερώνεται ο γεωπόνος ή ο αγρότης με οδηγίες για την αντιμετώπισης της ανωμαλίας αυτής",
        "Για την προτεινόμενη εφαρμογή απαιτείται ο κατάλληλος σχεδιασμός και ανάπτυξη αλγορίθμων καθώς και η δημιουργία σχετικού λογισμικού για την αυτόματη αξιολόγηση της αγροτικής καλλιέργειας από την ψηφιακή εικόνα.",
        "Αναπτύχθηκε μια πλατφόρμα ασύγχρονης εκπαίδευσης για την εξ αποστάσεως εκπαίδευση των αγροτών σε νέες τεχνολογίες για βιώσιμη γεωργία, ορθολογική χρήση φυτοφαρμάκων-λιπασμάτων και συντήρηση μηχανημάτων, ψεκαστήρες κ.λπ."
    ]
    
    // MARK: - GrowthView Texts
    
    static let growhthHeader = "Για την αποτύπωση της ανάπτυξης μιας καλλιέργειας προτείνονται στο έργο δυο τεχνικές υλοποίησης"
    
    static let growhthList = [
        "Μέσω εικόνων με τεχνικές τηλεπισκόπησης και μηχανικής μάθησης",
        "Μέσω μετρήσεων με αισθητήρα Lidar με υπολογιστικές τεχνικές"
    ]
    
    // MARK: - FindView Texts
    
    static let findViewHeader = "Σε μια καλλιέργεια εφόσον έχει υλοποιηθεί η αποτύπωσή της, μπορούμε εύκολα να εντοπίσουμε τις προβληματικές περιοχές"
    
    static let findViewList = [
        "Περιοχές με μεγαλύτερο ύψος από το μέσο όρο του ύψους της καλλιέργειας",
        "Περιοχές με μικρότερο ύψος από το μέσο όρο του ύψους της καλλιέργεια"
    ]
    
    static let findViewText = "Τις προβληματικές περιοχές τις προσεγγίζουμε είτε με drone είτε ο γεωργός ο ίδιος για να φωτογραφήσει το φυτό"
    
    static let findViewItem = "Εισάγουμε τη φωτογραφία στο μοντέλο μηχανικής μάθησης το οποίο μας επιστρέφει τη διάγνωση"
    
    
    // MARK: - DevelopingView Texts
    
    static let developingViewHeader = "Σύγκριση με υπάρχοντα μοντέλα όπως το EfficientNet B0-Β7"
    
    static let developingViewList = [
        "με τα μοντέλα Deep Learning μπορούμε να κάνουμε transfer learning (να μεταφέρουμε τη γνώση που έχει στα δικά μας δεδομένα) και να το ξαναεκπαιδεύσουμε",
        "καταλήξαμε ότι για τα πραγματικά δεδομένα που αφορούν τα υγιή φυτά και τα φυτά που έχουν προσβολή από ασθένειες, η εκπαίδευση είχε αποτελέσματα της τάξης του 88%, το validation ανήλθε στο 85%"
    ]
    
    static let developingViewExample = "Παράδειγμα"
    
    static let developingViewImageText = "Βαμβάκι Αφίδα 82%"
    
    static let developingViewText = "Η ανάπτυξη μοντέλου βαθιάς μηχανικής μάθησης είναι μια πολύ καλή τεχνική η οποία μπορεί να χρησιμοποιηθεί ευρύτερα και για την πρόγνωση περισσότερων εχθρών και ασθενειών με την υπάρχουσα εκπαίδευση, ενσωματώνοντας περισσότερες εικόνες, ώστε να υλοποιηθεί μια εφαρμογή για κινητές συσκευές, προκειμένου να διευκολυνθούν οι αγρότες στην αναγνώριση και αντιμετώπιση των προσβολών στο χωράφι"
    
    // MARK: - TeamView Texts
    
    static let teamMembers: [TeamStuct] =
    [
        TeamStuct(image: "Professor1", name: "ΑΛΚΙΒΙΆΔΗΣ ΤΣΙΜΠΊΡΗΣ", academicRole: "ΑΝΑΠΛΗΡΩΤΉΣ ΚΑΘΗΓΗΤΉΣ", projectRole: "Επιστημονικός Υπεύθυνος του έργου"),
        TeamStuct(image: "Professor2", name: "ΔΗΜΉΤΡΙΟΣ ΒΑΡΣΆΜΗΣ", academicRole: "ΚΑΘΗΓΗΤΉΣ", projectRole:"Ομάδα Τμήματος Μηχανικων Πληροφορικής, Υπολογιστών και Τηλεπικοινωνιών του ΔΙΠΑΕ"),
        TeamStuct(image: "Professor3", name: "ΧΑΡΆΛΑΜΠΟΣ ΣΤΡΟΥΘΌΠΟΥΛΟΣ", academicRole: "ΚΑΘΗΓΗΤΉΣ", projectRole:"Ομάδα Τμήματος Μηχανικων Πληροφορικής, Υπολογιστών και Τηλεπικοινωνιών του ΔΙΠΑΕ"),
        TeamStuct(image: "Professor4", name: "ΧΕΙΛΆΣ ΚΩΣΤΑΝΤΊΝΟΣ", academicRole: "ΚΑΘΗΓΗΤΉΣ", projectRole:"Ομάδα Τμήματος Μηχανικων Πληροφορικής, Υπολογιστών και Τηλεπικοινωνιών του ΔΙΠΑΕ"),
        TeamStuct(image: "Professor5", name: "ΒΟΛΟΓΙΑΝΝΊΔΗΣ ΣΤΑΎΡΟΣ", academicRole: "ΑΝΑΠΛΗΡΩΤΉΣ ΚΑΘΗΓΗΤΉΣ", projectRole:"Ομάδα Τμήματος Μηχανικων Πληροφορικής, Υπολογιστών και Τηλεπικοινωνιών του ΔΙΠΑΕ"),
        TeamStuct(image: "Professor6", name: "ΚΟΥΓΙΟΥΜΤΖΉΣ ΔΗΜΉΤΡΙΟΣ", academicRole: "ΚΑΘΗΓΗΤΉΣ ΤΜΉΜΑ ΗΜΜΗΥ, ΑΠΘ", projectRole:"Συνεργαζόμενα μέλη του Έργου"),
        TeamStuct(image: "Professor7", name: "ΠΑΠΑΚΩΝΣΤΑΝΤΊΝΟΣ ΑΠΌΣΤΟΛΟΣ", academicRole: "ΚΑΘΗΓΗΤΉΣ, ΠΑΝΕΠΙΣΤΉΜΙΟ ΚΎΠΡΟΥ", projectRole:"Συνεργαζόμενα μέλη του Έργου"),
        TeamStuct(image: "Professor8", name: "ΚΟΥΝΆΝΗ ΑΡΙΣΤΈΑ", academicRole: "ΓΕΩΠΌΝΟΣ, ΥΠΟΨΉΦΙΙΑ ΔΙΔΆΚΤΟΡΑΣ", projectRole:"Συνεργαζόμενα μέλη του Έργου"),
        TeamStuct(image: "Professor9", name: "ΑΓΓΕΙΟΠΛΆΣΤΗΣ ΑΘΑΝΆΣΙΟΣ", academicRole: "ΠΡΌΕΔΡΟΣ ΤΜΉΜΑΤΟΣ, ΑΝΑΠΛΗΡΩΤΉΣ ΚΑΘΗΓΗΤΉΣ", projectRole:"Συνεργαζόμενα μέλη του Έργου"),
    ]
    
    // MARK: - PackageView Texts
    
    static let packageList: [PackageStruct] =
    [
        PackageStruct(header: "ΕΕ1. Προδιαγραφές και αρχιτεκτονική", item1: "ΕΕ1.1: Καταγραφή ανάλυσης απαιτήσεων,  Ορισμός των περιπτώσεων χρήσης & Λήψη περιεχομένου για ανάλυση και προσομοίωση ",item2: "ΕΕ1.2: Αρχιτεκτονική, τεχνολογικό πλαίσιο δημιουργίας και διαχείριση συστήματος",item3: "ΕΕ1.3:  Διαχείριση Ποιότητας, παραγόμενων  δεδομένων και τεχνογνωσίας",item4: "ΕΕ1.4: Εκπαίδευση  στην αρχιτεκτονική, τεχνολογικό πλαίσιο δημιουργίας και διαχείριση συστήματος"),
        PackageStruct(header: "ΕΕ2. Αλγόριθμοι Βαθιάς Μηχανικής Μάθησης", item1: "ΕΕ2.1: Επιλογή, αρχική εκπαίδευση και προσαρμογή αλγορίθμων για την εφαρμογή μοντέλων βαθιάς μάθησης",item2: "ΕΕ2.2:  Δημιουργία  πρόσθετων δεδομένων εκμάθησης και επανεκπαίδευση και βελτιστοποίηση αλγορίθμων βαθιάς μάθησης",item3: "ΕΕ2.3: Εκπαίδευση  στην χρήση της της πλατφόρμας ασύγχρονης εκπαίδευσης"),
        PackageStruct(header: "ΕΕ3. Ενσωμάτωση των μοντέλων βαθιάς μηχανικής μάθησης σε διαδικτυακή εφαρμογή και προσθήκη λειτουργιών αυτοματισμού", item1: "ΕΕ3.1: Διαδικτυακής εφαρμογή και επικοινωνία με το μοντέλο βαθιάς μηχανικής  μάθησης",item2: "ΕΕ3.2:  Επικοινωνία διαδικτυακής εφαρμογής με πλατφόρμα ασύγχρονης εκπαίδευσης και υλοποίηση επιπλέον λειτουργιών αυτοματισμού",item3: "ΕΕ3.3:  Ασφάλεια πληροφοριών, ιδιωτικότητα & Μηχανισμοί ασφάλειας  της αρχιτεκτονικής του συστήματος"),
        PackageStruct(header: "ΕΕ4. Αξιολόγηση του ενοποιημένου συστήματος", item1: "ΕΕ4.1: Αξιολόγηση του ενοποιημένου συστήματος"),
        PackageStruct(header: "ΕΕ5. Υποστήριξη έργου", item1: "ΕΕ5.1: Αγορά εξοπλισμού και αναλωσίμων, συναντήσεις ομάδας έργου και άλλες ενέργειες υποστήριξης του έργου.")
    ]
    
    
    static var packageViewText: String { AppViewModel.shared.appLanguage == .greek
        ? "Πιλοτική  εγκατάσταση του ενοποιημένου συστήματος  σε διακομιστή  της επιχείρησης, σε πλαίσιο ελεγχόμενο (παράλληλα με τα άλλα συστήματα που θα αναπτυχθούν και λειτουργώντας επικουρικά). Αυτό θα δώσει  την δυνατότητα  να αξιολογηθούν τα άμεσα και έμμεσα  ποιοτικά χαρακτηριστικά της εφαρμογής (στατιστικά χρήσης των νέων λειτουργιών, αλλαγές συμπεριφοράς αγροτών και υπαλλήλων, βελτιωμένες  υπηρεσίες έγκαιρης πρόβλεψης κτλ.)"
        : "Test in enlgish"
    }
    
    
    
    // MARK: - ContractView Texts
    
    static let contractViewTitle = "Υπεύθυνοι Επικοινωνίας"
    
    static let contracts: [Contracts] =
    [
        Contracts(name: "Αλκιβιάδης Τσιμπίρης", projectRole: "Επιστημονικός Υπεύθυνος Έργου Αναπληρωτής Καθηγητής", phoneNumber: "+30 23210 49340", email: "atsimpiris@ihu.gr", website: "http://teachers.cm.ihu.gr/tsimpiris"),
        Contracts(name: "Δημήτριος Βαρσάμης", projectRole: "Αναπληρωτής Επιστημονικός Υπεύθυνος Έργου Καθηγητής, Πρόεδρος τμήματος", phoneNumber: "+30 23210 49381", email: "dvarsam@ihu.gr", website: "http://teachers.cm.ihu.gr/dvarsam/"),
        Contracts(name: "Αθανάσιος Αγγειοπλάστης", projectRole: "Υποψήφιος Διδάκτορας", phoneNumber: "+30 23210 49340", email: "aagiop@gmail.com", website: "")
        
    ]
}
