//
//  DiseasesViewTexts.swift
//  SmartFarmIHU
//
//  Created by Dimitris Giouvanakis on 12/12/24.
//

import Foundation


class DiseasesViewTexts {
    
    static let Text1 = "Οι 61 διαφορετικές κατηγορίες φυτικών ασθενειών που μπορεί να αναγνωρίσουν"
    
    static let Text2 = "τα 7 εκπαιδευμένα μοντέλα Βαθιάς Μηχανικής Μάθησης."
    
    let machineLearningModels = [
        "EfficientNetB0",
        "EfficientNetB1",
        "EfficientNetB7",
        "ResNet50",
        "VGG15",
        "MobileNet",
        "Custom SerresCNN",
    ]
    
    static let Text3 = "dataset με  61 κατηγορίες (38 VillagePlant Dataset +23 SerresPlant Dataset)"
    
    let plantDiseases = [
        "Αμπέλι Ερινώση",
        "Αμπέλι Ιαπωνικό σκαθάρι",
        "Αμπέλι Περονόσπορος",
        "Αμπέλι Φύλλα Υγιές",
        "Αμυγδαλιά εξοάσκος",
        "Αμυγδαλιά μονίλια",
        "Αμυγδαλιά υγιές",
        "Αμυγδαλιά φουζικόκο",
        "Αχλαδιά σκωρίασιAxladia Skoriash",
        "Βακκίνιο υγιές",
        "Βαμβάκη Αφίδες",
        "Βαμβάκη πράσινο σκουλίκι",
        "Βαμβάκη Τερτάνυξος",
        "Βαμβάκη Υγιές",
        "Βατόμουρο υγιές",
        "Βερυκοκιά σκαθάρη",
        "Γαρυφαλλιά Θύπας",
        "Ελιά Κυκλώνιο",
        "Ηλία άκαρη",
        "Ηλία υγιές",
        "Ιός μπούκλας κίτρινων φύλλων ντομάτας",
        "Καλαμπόκη Ανθράκας",
        "Καλαμπόκη Σεζαμία",
        "Καλαμπόκη υγιές",
        "Καλαμπόκι (αραβόσιτος) Βόρειος Φύλλος",
        "Καλαμπόκι (καλαμπόκι) Κηλίδα φύλλου Cercospora Γκρι κηλίδα φύλλου",
        "Καλαμπόκι (καλαμπόκι) Κοινή σκουριά",
        "Καλαμπόκι (καλαμπόκι) υγιές",
        "Καρύδια Ανθρακός",
        "Καψάλισμα φύλλων φράουλας",
        "Κεράσι (συμπεριλαμβανομένου του ξινιού) υγιές",
        "Κεράσι (συμπεριλαμβανομένου του ξινού) Ερυσίδι",
        "Κηλίδα σε φύλλα ντομάτας Septoria",
        "Κηλίδα φύλλων σταφυλιού (Isariopsis Leaf Spot)",
        "Κολοκυθάκι ωίδιο",
        "Μαύρη σήψη σταφυλιού",
        "Μήλο Cedar σκουριά μήλων",
        "Μήλο Septoriosh",
        "Μήλο Μαύρη σήψη",
        "Μήλο μήλο ψώρα",
        "Μήλο υγιές",
        "Μούχλα φύλλων όψιμης ντομάτας",
        "Μχλια Μχλολονθη",
        "Ντομάτα Ακάρεα αράχνης με δύο κηλίδες",
        "Ντομάτα Βακτηριδιακό σημείο",
        "Ντομάτα Ιός μωσαϊκού ντομάτας",
        "Ντομάτα Πρώιμη μάστιγα",
        "Ντομάτα υγιής",
        "Πατάτα όψιμο μόσχο",
        "Πατάτα Πρώιμη μάστιγα",
        "Πατάτα υγιής",
        "Πιπέρι υγιές",
        "Πιπεριά καμπάνα Βακτηριδιακό σημείο",
        "Πορτοκαλί Haunglongbing (πρασίνισμα εσπεριδοειδών)",
        "Ροδάκινο Βακτηριδιακό σημείο",
        "Ροδάκινο υγιές",
        "Σημείο στόχου ντομάτας",
        "Σόγια υγιής",
        "Σταφύλι esca (Μαύρη Ιλαρά)",
        "Σταφύλι υγιές",
        "Φράουλα υγιής"
    ]

    
}
